{
    "name": "CRISP PANKO CHICKEN CUTLETS W/TONKATSU SAUCE",
    "author": "MMAfv3oCQDiL4u10",
    "description": "Enjoy it",
    "datePosted": 1638172867145,
    "servingSize": 4,
    "image": "https://img.sndimg.com/food/image/upload/c_thumb,q_80,w_721,h_406/v1/img/recipes/48/60/6/SPjdaJBSQ52c0Kbe0vsT_0S9A7403.jpg",
    "tags": ["Lunch", "Hard"],
    "cookTime": "37mins",
    "difficulty": "5 star",

    "ingredients": [
        {
            "boneless skinless chicken breast halves": 4
        },
        {
            "cup flour": 0.5
        },
        {
            "eggs, lightly whisked": 3
        },
        {
            "water": 1
        },
        {
            "cups japanese panko breadcrumbs": 2
        },
        {
            "head cabbage, shredded": 1
        }
    ],
    "steps": [
        "With a sharp knife, lightly score both sides of the chicken breasts in a checkerboard pattern.",
    "Lay a sheet of plastic wrap over the breasts and pound until they are about ½ inch thick.",
    "Season with salt and pepper.",
    "Dredge the chicken in the flour and then dip it in the beaten eggs, shaking to remove excess.",
    "Dip each piece in the flour and egg again an then coat the chicken in the panko.",
    "In a deep, straight sided sauté pan, heat about ¼ inch vegetable oil over medium high heat until the oil ripples and simmers in the pan and instantly erupts into lots of bubbles when you dip a corner of the chicken breast into it.",
    "Immediately reduce the heat to medium low and fry the chicken in batches until cooked through and golden on both sides, 4 to 6 minutes per side.",
    "If the oil seems to cool down to much during frying, increase the heat a little to maintain a steady bubbling action.",
    "Drain the chicken on paper towels and serve it with abundant shredded cabbage and tonkatsu sauce.",
    "tonkatsu sauce: In a small saucepan, whisk together the Worcestershire, sugar, soy sauce and ketchup.",
    "Bring to a simmer over medium low heat. Reduce the heat to gentle simmer and whisk often until reduced to 1 cup, about 10 minutes.",
    "Whisk in mustard and allspice.",
    "Cool to room temperature.",
    "The sauce will keep for 1 week in the refrigerator."
]
    
}